In [163]:
import pandas as pd
import numpy as np

In [164]:
df = pd.read_csv('titanic_dataset.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [165]:
df = df[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Cabin', 'Embarked', 'Survived']]
df.head()

   Pclass     Sex   Age  SibSp  Parch Cabin Embarked  Survived
0       3    male  22.0      1      0   NaN        S         0
1       1  female  38.0      1      0   C85        C         1
2       3  female  26.0      0      0   NaN        S         1
3       1  female  35.0      1      0  C123        S         1
4       3    male  35.0      0      0   NaN        S         0

In [166]:
df.isnull().sum()

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Cabin       687
Embarked      2
Survived      0
dtype: int64

In [167]:
df.shape

(891, 8)

In [168]:
round((df.isnull().sum() / df.shape[0]) * 100)

Pclass       0.0
Sex          0.0
Age         20.0
SibSp        0.0
Parch        0.0
Cabin       77.0
Embarked     0.0
Survived     0.0
dtype: float64

In [169]:
df = df.drop(columns='Cabin')

In [170]:
df.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Embarked', 'Survived'], dtype='object')

In [171]:
df.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [172]:
df.isna().sum()

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Embarked      2
Survived      0
dtype: int64

In [173]:
df['Age'] = round(df['Age'].mean())
df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    889 non-null    int64
 1   Sex       889 non-null    object
 2   Age       889 non-null    int64
 3   SibSp     889 non-null    int64
 4   Parch     889 non-null    int64
 5   Embarked  889 non-null    object
 6   Survived  889 non-null    int64
dtypes: int64(5), object(2)
memory usage: 55.6+ KB

In [174]:
df.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [175]:
df.shape

(889, 7)

In [176]:
print(df.head())
print(df.tail())

   Pclass     Sex  Age  SibSp  Parch Embarked  Survived
0       3    male   30      1      0        S         0
1       1  female   30      1      0        C         1
2       3  female   30      0      0        S         1
3       1  female   30      1      0        S         1
4       3    male   30      0      0        S         0
     Pclass     Sex  Age  SibSp  Parch Embarked  Survived
886       2    male   30      0      0        S         0
887       1  female   30      0      0        S         1
888       3  female   30      1      2        S         0
889       1    male   30      0      0        C         1
890       3    male   30      0      0        Q         0

In [178]:
df.to_csv('cleaned_titanic_df.csv', index=True)
pd.read_csv('cleaned_titanic_df.csv')

     Unnamed: 0  Pclass     Sex  Age  SibSp  Parch Embarked  Survived
0             0       3    male   30      1      0        S         0
1             1       1  female   30      1      0        C         1
2             2       3  female   30      0      0        S         1
3             3       1  female   30      1      0        S         1
4             4       3    male   30      0      0        S         0
..          ...     ...     ...  ...    ...    ...      ...       ...
884         886       2    male   30      0      0        S         0
885         887       1  female   30      0      0        S         1
886         888       3  female   30      1      2        S         0
887         889       1    male   30      0      0        C         1
888         890       3    male   30      0      0        Q         0

[889 rows x 8 columns]